// import Vue from 'vue'
// 数据字典
export const dataDic = (val) => {
  return {
    '1': '成功',
    '2': '失败',
    '3': '核验中...',
    '4': '等待核验'
  }[val] || ''
}

// 图片字典
export const dataDicImg = (val) => {
  return {
    '1': require('@/assets/img/success.png'),
    '2': require('@/assets/img/error.png'),
    '3': require('@/assets/img/loading.png')
  }[val] || ''
}

// 状态字典
export const statusDic = (val) => {
  return {
    '-1': '无',
    '100': '正在销售',
    '200': '已停止销售',
    '250': '已经经生成开奖号码',
    '300': '已弃奖统计',
    '400': '已合并外部数据',
    '500': '已生成审计数据',
    '600': '已期汇总',
    '700': '已开奖',
    '800': '已生成外部数据',
    '900': '已转储',
    '1000': '已弃奖'
  }[val] || ''
}

// 交易详情交易结果转换
export const trans = (val) => {
  return {
    '0': '成功',
    '1': '失败'
  }[val] || ''
}

// 过滤金钱为千分位
export const money = (num, precision = 2) => {
  if (typeof num !== 'number' && !num) {
    return ''
  }
  return `${(+num).toFixed(precision).replace(/(\d)(?=(\d{3})+\.)/g, '$&,')}`
}

// 默认给金额后面家上中文元
export const dismon = (num) => {
  if (num === '-') return num
  return num + '元'
}

// 账户类型转换
export const acctype = (val) => {
  return {
    '1': '站点钱包',
    '2': '彩民钱包',
    '3': '系统钱包'
  }[val] || ''
}

// 账户交易信息
export const accountType = (val) => {
  return {
    '1': '转入',
    '2': '转出',
    '3': '-'
  }[val] || ''
}

// 业务类型状态码转换
export const bizForamt = (val) => {
  return {
    '1000': '创建系统账户',
    '1001': '创建站点账户',
    '1002': '创建彩民账户',
    '2000': '站点缴款',
    '2001': '站点调帐',
    '2002': '站点代销费',
    '2004': '站点代兑费',
    '2005': '站点代销(兑)费返还',
    '2003': ' 站点代销费',
    '3000': '彩民充值',
    '3001': '彩民充值撤销',
    '3002': '彩民提现',
    '3003': '彩民提现撤销',
    '4000': '投注',
    '4001': '投注冲正',
    '4002': '注销',
    '4003': '注销恢复',
    '4004': '中奖票',
    '4005': '兑大奖',
    '4006': '兑奖',
    '4007': '兑奖恢复',
    '4008': '弃奖票',
    '5000': '开始新期',
    '5001': '销售截止',
    '5002': '销量封存',
    '5003': '开奖存证',
    '5004': '资金结算',
    '5005': '奖池资金收支',
    '5006': '开奖公告',
    '5007': '弃奖数据汇总',
    '5008': '奖池基金流水',
    '6000': '期销售数据封存',
    '6001': '随机数签名',
    '6002': '随机数上链',
    '6003': '开奖结果'
  }[val] || ''
}

// 根据特别的几个业务类型状态码进行隐藏
export const blockType = (val) => {
  let type = ['1000', '1001', '1002', '4004', '4008', '5000', '5001', '5002', '5003', '5004', '5005', '5006', '5007', '6000', '6001', '6002', '6003', '2004', '2005', '2003']
  return type.includes(val)
}
